saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KEAxx_DFP</name>
  <description>NXP Kinetis KEAxx Series Device Support and Examples</description>

  <releases>
    <release version="1.3.0" date="2017-05-08">
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions.
      Updated boards description.
      Changed device vendor to NXP.
    </release>
    <release version="1.2.0" date="2015-02-12">
      Added TRK-KEA boards and examples.
      Reworked conditions, startup.
    </release>
    <release version="1.1.0" date="2014-08-28">
      Corrected memory settings for SRAM to form a single contiguous region.
      Udpated CMSIS-Core files to latest version from NXP.
    </release>
    <release version="1.0.0">
      First Release version of KEAxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KEAxx</keyword>
    <keyword>TRK-KEA8</keyword>
    <keyword>TRK-KEA64</keyword>
    <keyword>TRK-KEA128</keyword>
  </keywords>

  <devices>
    <family Dfamily="KEAxx Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <description>
Kinetis EA series of 32-bit ARM® Cortex® MCUs are targeted for a wide range of automotive and industrial applications requiring the highest level of quality and longevity support.
The Kinetis EA series is an entry point to the broad ARM ecosystem and features:
 - A low-power ARM Cortex-M0+ core and 8–128 KB of embedded flash
 - Excellent EMC/ESD, high temperature and low radiated emissions
 - Scalable, highly robust performance solution for cost-sensitive automotive applications
 - A broad set of reference designs, tools and application notes to help shorten design development and speed time-to-market
      </description>


      <!-- ******************************  SKEAZ128xxx4  ****************************** -->
      <device Dname="SKEAZ128xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZ1284.h" define="SKEAZ128xxx4"/>
        <debug svd="SVD/SKEAZ1284.svd"/>
        <memory id="IROM1"                           start="0x00000000" size="0x00020000" startup="1" default="1"/>
        <memory id="IRAM1"                           start="0x1FFFF000" size="0x00004000"             default="1"/>
        <algorithm name="Flash/MKE04Zxxx_P128KB.FLM" start="0x00000000" size="0x00020000"             default="1"/>

        <book name="Documents/KEA128RM.pdf"         title="SKEAZ128xxx4 Device Reference Manual"/>
        <book name="Documents/SKEA128P80M48SF0.pdf" title="SKEAZ128xxx4 Device Data Sheet"/>
      </device>

      <!-- ******************************  SKEAZ64xxx4  ****************************** -->
      <device Dname="SKEAZ64xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZ1284.h" define="SKEAZ64xxx4"/>
        <debug svd="SVD/SKEAZ1284.svd"/>
        <memory id="IROM1"                          start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IRAM1"                          start="0x1FFFF800" size="0x00002000"             default="1"/>
        <algorithm name="Flash/MKE04Zxxx_P64KB.FLM" start="0x00000000" size="0x00010000"             default="1"/>

        <book name="Documents/KEA128RM.pdf"         title="SKEAZ64xxx4 Device Reference Manual"/>
        <book name="Documents/SKEA128P80M48SF0.pdf" title="SKEAZ64xxx4 Device Data Sheet"/>
      </device>

      <!-- ******************************  SKEAZN8xxx4  ****************************** -->
      <device Dname="SKEAZN8xxx4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZN84.h" define="SKEAZN8xxx4"/>
        <debug svd="SVD/SKEAZN84.svd"/>
        <memory id="IROM1"                         start="0x00000000" size="0x00002000" startup="1" default="1"/>
        <memory id="IRAM1"                         start="0x1FFFFF00" size="0x00000400"             default="1"/>
        <algorithm name="Flash/MKE04Zxxx_P8KB.FLM" start="0x00000000" size="0x00002000"             default="1"/>

        <book name="Documents/KEA8RM.pdf"         title="SKEAZN8xxx4 Device Reference Manual"/>
        <book name="Documents/SKEA8P44M48SF0.pdf" title="SKEAZN8xxx4 Device Data Sheet"/>
      </device>

      <!-- ******************************  SKEAZN16xxx2  ****************************** -->
      <device Dname="SKEAZN16xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZN642.h" define="SKEAZN16xxx2"/>
        <debug svd="SVD/SKEAZN642.svd"/>
        <memory id="IROM1"                           start="0x00000000" size="0x00004000" startup="1" default="1"/>
        <memory id="IRAM1"                           start="0x1FFFFE00" size="0x00000800"             default="1"/>
        <algorithm name="Flash/MKE02Zxxx_P16KB.FLM"  start="0x00000000" size="0x00004000"             default="1"/>
        <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100"             default="1"/>

        <book name="Documents/KEA64RM.pdf"         title="SKEAZN16xxx2 Device Reference Manual"/>
        <book name="Documents/SKEA64P64M20SF0.pdf" title="SKEAZN16xxx2 Device Data Sheet"/>
      </device>

      <!-- ******************************  SKEAZN32xxx2  ****************************** -->
      <device Dname="SKEAZN32xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZN642.h" define="SKEAZN32xxx2"/>
        <debug svd="SVD/SKEAZN642.svd"/>
        <memory id="IROM1"                           start="0x00000000" size="0x00008000" startup="1" default="1"/>
        <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000"             default="1"/>
        <algorithm name="Flash/MKE02Zxxx_P32KB.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00000800" default="1"/>
        <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100" RAMstart="0x1FFFFC00" RAMsize="0x00000800" default="1"/>

        <book name="Documents/KEA64RM.pdf"         title="SKEAZN32xxx2 Device Reference Manual"/>
        <book name="Documents/SKEA64P64M20SF0.pdf" title="SKEAZN32xxx2 Device Data Sheet"/>
      </device>

