saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.3.0.pdsc
      <!-- ******************************  SKEAZN64xxx2  ****************************** -->
      <device Dname="SKEAZN64xxx2">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
        <compile header="Device/Include/SKEAZN642.h" define="SKEAZN64xxx2"/>
        <debug svd="SVD/SKEAZN642.svd"/>
        <memory id="IROM1"                           start="0x00000000" size="0x00010000" startup="1" default="1"/>
        <memory id="IRAM1"                           start="0x1FFFFC00" size="0x00001000"             default="1"/>
        <algorithm name="Flash/MKE02Zxxx_P64KB.FLM"  start="0x00000000" size="0x00010000"             default="1"/>
        <algorithm name="Flash/MKE02Zxxx_EE256B.FLM" start="0x10000000" size="0x00000100"             default="1"/>

        <book name="Documents/KEA64RM.pdf"         title="SKEAZN64xxx2 Device Reference Manual"/>
        <book name="Documents/SKEA64P64M20SF0.pdf" title="SKEAZN64xxx2 Device Data Sheet"/>
      </device>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SKEAZ128 CMSIS">
      <description>NXP Kinetis SKEAZ128 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="SKEAZ128xxx4"/>
      <accept Dname="SKEAZ64xxx4"/>
    </condition>

    <condition id="SKEAZN8 CMSIS">
      <description>NXP Kinetis SKEAZN8 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="SKEAZN8xxx4"/>
    </condition>

    <condition id="SKEAZNxxx2 CMSIS">
      <description>NXP Kinetis SKEAZN 20MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="SKEAZN16xxx2"/>
      <accept Dname="SKEAZN32xxx2"/>
      <accept Dname="SKEAZN64xxx2"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup SKEAZ128 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZ128 CMSIS">
      <description>System Startup for NXP Kinetis SKEAZ128 48MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_SKEAZ1284.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SKEAZ1284.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SKEAZN8 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZN8 CMSIS">
      <description>System Startup for NXP Kinetis SKEAZN8 48MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_SKEAZN84.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SKEAZN84.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SKEAZNxxx2 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SKEAZNxxx2 CMSIS">
      <description>System Startup for NXP Kinetis SKEAZN 20MHz devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_SKEAZN642.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_SKEAZN642.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- TRK-KEA8 board support -->
    <bundle Cbundle="TRK-KEA8" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP TRK-KEA8 board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SKEAZN8 CMSIS">
      <description>LED driver for NXP TRK-KEA8 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA8/Common/LED_TRK-KEA8.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SKEAZN8 CMSIS">
      <description>Button driver for NXP TRK-KEA8 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA8/Common/Buttons_TRK-KEA8.c"/>
        </files>
      </component>
    </bundle>

    <!-- TRK-KEA64 board support -->
    <bundle Cbundle="TRK-KEA64" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP TRK-KEA64 board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SKEAZNxxx2 CMSIS">
      <description>LED driver for NXP TRK-KEA64 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA64/Common/LED_TRK-KEA64.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SKEAZNxxx2 CMSIS">
      <description>Button driver for NXP TRK-KEA64 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA64/Common/Buttons_TRK-KEA64.c"/>
        </files>
      </component>
    </bundle>

    <!-- TRK-KEA128 board support -->
    <bundle Cbundle="TRK-KEA128" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP TRK-KEA128 board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SKEAZ128 CMSIS">
      <description>LED driver for NXP TRK-KEA128 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA128/Common/LED_TRK-KEA128.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SKEAZ128 CMSIS">
      <description>Button driver for NXP TRK-KEA128 board</description>
        <files>
          <file category="source" name="Boards/NXP/TRK-KEA128/Common/Buttons_TRK-KEA128.c"/>
        </files>
      </component>
    </bundle>

  </components>

