saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.3.0.pdsc
  <boards>
    <!-- TRK-KEA8 board -->
    <board vendor="NXP" name="TRK-KEA8" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>TRK-KEA8: Kinetis KEA8 StarterTRAK for Low-end Automotive Applications</description>
      <image small="Boards/NXP/TRK-KEA8/Documentation/TRK-KEA8_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/startertrak-development-boards/kinetis-kea8-startertrak-for-low-end-automotive-applications:TRK-KEA8" title="TRK-KEA8 Web Page"/>
      <book category="schematic" name="Boards/NXP/TRK-KEA8/Documentation/TRK-KEA8_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TRK-KEA8/Documentation/KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="SKEAZN8xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>

    <!-- TRK-KEA64 board -->
    <board vendor="NXP" name="TRK-KEA64" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>TRK-KEA64: Kinetis KEA64 StarterTRAK with 256B EEPROM</description>
      <image small="Boards/NXP/TRK-KEA64/Documentation/TRK-KEA64_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/startertrak-development-boards/kinetis-kea8-startertrak-for-low-end-automotive-applications:TRK-KEA64" title="TRK-KEA64 Web Page"/>
      <book category="schematic" name="Boards/NXP/TRK-KEA64/Documentation/TRK-KEA64_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TRK-KEA64/Documentation/KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="SKEAZN64xxx2"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>

    <!-- TRK-KEA128 board -->
    <board vendor="NXP" name="TRK-KEA128" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <description>TRK-KEA128: Kinetis KEA128 StarterTRAK for CAN Applications</description>
      <image small="Boards/NXP/TRK-KEA128/Documentation/TRK-KEA128_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/startertrak-development-boards/kinetis-kea8-startertrak-for-low-end-automotive-applications:TRK-KEA128" title="TRK-KEA128 Web Page"/>
      <book category="schematic" name="Boards/NXP/TRK-KEA128/Documentation/TRK-KEA128_SCH.pdf"  title="Schematics"/>
      <book category="manual"    name="Boards/NXP/TRK-KEA128/Documentation/KINTESMCUAUTQSG.pdf" title="Quick Start Guide" />
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="SKEAZ128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KEAxx Series"/>
      <feature type="Button"    n="4"              name="Push-buttons: Reset, OpenSDA Reset, 2x User"/>
      <feature type="LED"       n="6"              name="LEDs: Power, SDA, 4x User"/>
      <feature type="CAN"       n="1"              name="CAN Connector"/>
      <feature type="ConnOther" n="1"              name="LIN Connector"/>
      <feature type="LightSens" n="1"              name="Light Sensor"/>
      <feature type="CustomFF"  n="9"  m="8"       name="Individual Port Access"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="5"  m="12"      name="External Supply"/>
      <feature type="ODbg"      n="1"              name="Onboard OpenSDA via USB"/>
    </board>
  </boards>

  <examples>
    <!-- TRK-KEA8 board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA8/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TRK-KEA8" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA8_Lab1" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA8/NXP_Labs/TRK-KEA8_Keil_Lab1">
      <description>TRK-KEA8 Keil LAB1 - Serial communication Interface (UART)</description>
      <board name="TRK-KEA8" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA8_Lab1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

