saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.3.0.pdsc
    <example name="TRK-KEA8_Lab2" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA8/NXP_Labs/TRK-KEA8_Keil_Lab2">
      <description>TRK-KEA8 Keil LAB2 – FlexTimer (FTM)</description>
      <board name="TRK-KEA8" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA8_Lab2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA8_Lab3" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA8/NXP_Labs/TRK-KEA8_Keil_Lab3">
      <description>TRK-KEA8 Keil LAB3 - Analog to Digital Converter (ADC)</description>
      <board name="TRK-KEA8" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA8_Lab3.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA8_Lab4" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA8/NXP_Labs/TRK-KEA8_Keil_Lab4">
      <description>TRK-KEA8 Keil LAB4 - Keyboard Interrupt (KBI)</description>
      <board name="TRK-KEA8" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA8_Lab4.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TRK-KEA64 board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA64/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TRK-KEA64" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA64_Lab1" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA64/NXP_Labs/TRK-KEA64_Keil_Lab1">
      <description>TRK-KEA64 Keil LAB1 - Serial communication Interface (UART)</description>
      <board name="TRK-KEA64" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA64_Lab1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA64_Lab2" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA64/NXP_Labs/TRK-KEA64_Keil_Lab2">
      <description>TRK-KEA64 Keil LAB2 – FlexTimer (FTM)</description>
      <board name="TRK-KEA64" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA64_Lab2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA64_Lab3" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA64/NXP_Labs/TRK-KEA64_Keil_Lab3">
      <description>TRK-KEA64 Keil LAB3 - Analog to Digital Converter (ADC)</description>
      <board name="TRK-KEA64" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA64_Lab3.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA64_Lab4" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA64/NXP_Labs/TRK-KEA64_Keil_Lab4">
      <description>TRK-KEA64 Keil LAB4 - Keyboard Interrupt (KBI)</description>
      <board name="TRK-KEA64" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA64_Lab4.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TRK-KEA128 board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA128_Lab1" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/NXP_Labs/TRK-KEA128_Keil_Lab1">
      <description>TRK-KEA128 Keil LAB1 - Serial communication Interface (UART)</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA128_Lab1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

