saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KEAxx_DFP.1.3.0.pdsc
    <example name="TRK-KEA128_Lab2" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/NXP_Labs/TRK-KEA128_Keil_Lab2">
      <description>TRK-KEA128 Keil LAB2 – FlexTimer (FTM)</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA128_Lab2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA128_Lab3" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/NXP_Labs/TRK-KEA128_Keil_Lab3">
      <description>TRK-KEA128 Keil LAB3 - Analog to Digital Converter (ADC)</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA128_Lab3.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA128_Lab4" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/NXP_Labs/TRK-KEA128_Keil_Lab4">
      <description>TRK-KEA128 Keil LAB4 - Keyboard Interrupt (KBI)</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA128_Lab4.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="TRK-KEA128_Lab5" doc="Abstract.txt" folder="Boards/NXP/TRK-KEA128/NXP_Labs/TRK-KEA128_Keil_Lab5">
      <description>TRK-KEA128 Keil LAB5 - Pulse Width Timer (PWT)</description>
      <board name="TRK-KEA128" vendor="NXP"/>
      <project>
        <environment name="uv" load="TRK-KEA128_Lab5.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
